src/per-bdd-2026/justificacion-de-normalizacion/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-27 mar 18:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>¿Por que es importante la normalización de bases de datos?</title>
<meta name="author" content="Oshiro Arika" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">¿Por que es importante la normalización de bases de datos?</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3caaac8">1. ¿Que es la normalización de Bases de Datos?</a></li>
<li><a href="#org923b93d">2. Objetivos de la normalización de bases de datos</a></li>
<li><a href="#orgf0b976f">3. ¿Por que es importante normalizar una base de datos?</a></li>
<li><a href="#org2b02d33">4. Fuentes</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3caaac8" class="outline-2">
<h2 id="org3caaac8"><span class="section-number-2">1.</span> ¿Que es la normalización de Bases de Datos?</h2>
<div class="outline-text-2" id="text-1">
<p>
La normalización de una base de datos es un paso esencial tras su creación, por que evita cualquier tipo de anomalía, redundancia y borrado que pueda haber en el diseño de tablas y en la relación entre la información.
</p>

<p>
– <i>Pero&#x2026; ¿Para qué tenemos que normalizar una base de datos?</i>
</p>

<p>
Pues para evitar que uno o mas datos estén duplicados en la tabla de una base de datos, o sea, no pueden haber mas dos María con el mismo ID. O datos que no estén en uso.
</p>

<p>
Esto y otros factores pueden causar confusión en una base de datos tanto a ti como a un Sistema Gestor de Bases de Datos (SGBD), ademas de que dicha base de datos sera mas pesada, lenta y difícil de manejar.
</p>

<p>
Una normalización de base de datos, sobretodo para empresas B2B, requiere una importante inversión de tiempo y esfuerzo, debido a que contiene muchos datos complejos.
</p>

<p>
A pesar de que <i>—En algunos casos—</i> las bases de datos normalizadas hacen los procesos mas lentos, aun así merece la pena hacer la normalización para evitar problemas a futuro.
</p>
</div>
</div>
<div id="outline-container-org923b93d" class="outline-2">
<h2 id="org923b93d"><span class="section-number-2">2.</span> Objetivos de la normalización de bases de datos</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Corregir datos duplicados y anomalías en la base de datos.</li>
<li>Evitar la creación y actualización de relaciones y dependencias no deseadas entre datos.</li>
<li>Prevenir la eliminación de datos accidentales</li>
<li>Optimizar el uso de almacenamiento.</li>
<li>Reducir el tiempo y complejidad de revisión cuando se requiere introducir nuevos tipos de datos.</li>
<li>Facilitar el acceso e interpretación de los datos a los usuarios y aplicaciones que los usan.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf0b976f" class="outline-2">
<h2 id="orgf0b976f"><span class="section-number-2">3.</span> ¿Por que es importante normalizar una base de datos?</h2>
<div class="outline-text-2" id="text-3">
<p>
Como lo que se escribió antes, ayuda a las empresas e instituciones a organizar, consultar y mantener de forma mas eficaz grandes volúmenes de datos complejos, interrelaciones y dinámicos.
</p>

<p>
Los datos sin normalizar y desordenados dificultan la compresión y mecánica, afectando negativamente la funcionalidad de las características y funciones.  Por ejemplo, al buscar &ldquo;Google Chrome&rdquo; es posible que no muestre los mismos resultados que &ldquo;Chrome&rdquo; debido a incoherencias en la representación de los datos.  Esto merma la precisión y eficacia de los procesos de consulta, lo que conduce a resultados inadecuados y conexiones incompletas.
</p>

<p>
Por eso, lo normalización hace que la búsqueda de términos o entidades especificas sea mas eficiente y precisa.  Las conexiones entre elementos de datos relacionados se refuerzan, lo que permite mejorar la recuperación y el análisis de la información.
</p>

<p>
Ademas, esta practica tiene implicancias mas amplias para la funcionalidad y el rendimiento de las bases de datos.  Aquellos normalizados son mas fáciles de ordenar, filtrar y analizar, lo que facilita su exploración y reconocimiento de patrones.  Con una menor cantidad de columnas y una organización mejorada, los usuarios acceden a mas registros en una sola pagina, mayor visualización, compresión y reconocimiento de patrones.
</p>

<p>
Por el lado de la experiencia del usuario, simplifica los procesos, permitiéndoles contar fácilmente con la información y modificarla, al tiempo que garantiza la coherencia, la precisión y la ausencia de contenidos duplicados o redundancias.  Así, múltiples personas pueden leer, interpretar y confiar en los registros presentados.
</p>
</div>
</div>
<div id="outline-container-org2b02d33" class="outline-2">
<h2 id="org2b02d33"><span class="section-number-2">4.</span> Fuentes</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://blog.saleslayer.com/es/por-que-es-importante-la-normalizacion-de-base-de-datos">https://blog.saleslayer.com/es/por-que-es-importante-la-normalizacion-de-base-de-datos</a></li>
<li><a href="https://www.ibm.com/es-es/think/topics/database-normalization">https://www.ibm.com/es-es/think/topics/database-normalization</a></li>
<li><a href="https://blog.invgate.com/es/normalizacion-de-base-de-datos">https://blog.invgate.com/es/normalizacion-de-base-de-datos</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Oshiro Arika</p>
<p class="date">Created: 2026-01-27 mar 18:55</p>
</div>
</body>
</html>
